[R] Scaling Laws for Neural Machine Translation https://t.co/Cuv1W5yhJb
[N][R] Want to leverage synthetic data for 3d reconstruction, but don't want to deal with the photometric domain ga… https://t.co/2KLf8mx92Z
[R] what happens if you use Bayesian filter before object detection in tracking https://t.co/mopgSNPv8m
[N] Open Sourcing Checkpoint 🛂 https://t.co/Ib3ithv42s
[D] Probabilistic Modelling of Large Count Data https://t.co/yxuaEzF2N1
GraphSAGE: Inductive Representation Learning in Large Graphs (Paper Walkthrough) [D] https://t.co/WHOudqsXp0
Does anyone know what ML/Neuro project Google X is working on? [D] [T] https://t.co/27veAyy2F0
[D] Discussing abductive inference with the author of "The Myth of Artificial Intelligence" https://t.co/TKkoSdahnp
[D] Significant differences in Training on 1 GPU vs 8GPU ? https://t.co/b9pCoM7SNs
[D] Object-NeRF Paper Explained - Learning Object-Compositional Neural Radiance Field for Editable Scene Rendering… https://t.co/z5NYjymy3h
[D] Questions About Cross Stage Partial Networks (CSPNet) https://t.co/W6wLsHlcLF
[D] Geometric Deep Learning Blueprint (Video on MLST) https://t.co/AsjyaQmOeU
[D] Can someone please suggest how to begin working on a problem like this? https://t.co/UcqTAvqAPD
[D] Controllable Generation from Pre-trained Language Models via Inverse Prompting (Paper Summary) https://t.co/tqG5zA3x9N
[R] Scalable Open Architecture for Embedded Edge (SOAFEE) https://t.co/0LPvKpUxKV
[D] What makes a paper good? https://t.co/9czdcr79A1
[D] Understanding Lagrangian in SVM https://t.co/aageeDgMzp
[R] Slides and Videos of ICML 2021: Thirty-eighth International Conference on Machine Learning (… https://t.co/G9owMV5bq0
[D] Submit to two conferences at the same time https://t.co/gGP5LUbe7F
[P] TFServingCache: A distributed LRU-cache for serving TensorFlow models in Kubernetes https://t.co/pX8sjuieIa
[D] Deep learning equivalent of Bogosort? https://t.co/6kzp3XQCEN
[Discussion] Any advanced NLP tutorial to refresh a veteran's memory? https://t.co/zvepgBqIz9
[D] NeurIPS 2021 DeepRacer Challenge launched. https://t.co/YvDpn3Bzy2
[R] CMU, Google &amp; UC Berkeley Propose Robust Predictable Control Policies for RL Agents https://t.co/PDpTfJ3AtB
[D] Google-AI FLAN Paper Explained - Finetuned Language Models Are Zero-Shot Learners (5-Minute Summary) https://t.co/rZMKikvcxB
Best Algorithm to Use for Proposed Framework/Problem? [R] https://t.co/dxO7G1PGy1
[R] Good book/resource on probabilistic graphical models/Bayesian networks? https://t.co/weDIZWxPVM
[R] Using Triplet Loss and Siamese Neural Networks to Train Catalog Item Embeddings https://t.co/rrwKd8tI9n
[D] State of PyTorch Core - September 2021 edition: A summary of the core features that the PyTorch team is working… https://t.co/BYTj16xvY4
[R] What Changes Can Large-scale Language Models Bring? Intensive Study on HyperCLOVA: Billions-scale Korean Genera… https://t.co/ZBBbgUx5DF
[R] Bootstrapped Meta-Learning https://t.co/yp4cYa3TZ1
[R] Feature selection algorithms for psychometric questions when the predicted variable is multi-dimensional? https://t.co/t9dzywC7GB
[P] Using Deep Learning to draw and write with your hand and webcam 👆. The model tries to predict whether you want… https://t.co/gEk6a47kLq
[R] Deploying a Python machine learning app on Kubernetes https://t.co/TGH0srkZvc
[R] Unlocking Pixels for Reinforcement Learning via Implicit Attention https://t.co/b4Ek5Pd1A4
[news] Make Slow Motion Videos With AI! TimeLens explained: a new model for video frame interpolation published at… https://t.co/QEVLruBQQd
[P] Machine Learning working on the challenge of sepsis https://t.co/cJCu7pDrM7
[D] Does there exist a "purely qualitative" situation? https://t.co/xWdUaj6HQP
[P] Training a spiking NN to produce images https://t.co/XDTH3xf1Z0
[R] Facebook AI Introduces GSLM (Generative Spoken Language Model), A Textless NLP Model That Breaks Free Completel… https://t.co/ysF0k6Rmue
[P] Demo, using OpenAI GPT and Replica AI to have conversations with NPC in video games https://t.co/o3UmMWoRcU
[D] What is your experience with the different types of APIs and messaging services for real-time inference APIs? https://t.co/GCZruhLQAi
[N] Salesforce Open-Sources ‘CodeT5’, A Machine Learning Model That Understands and Generates Code in Real Time https://t.co/WDuuSHf5fJ
[D] COLING 2022 will be held in Gyeongju, South Korea. https://t.co/cl5SJKvTHl
[D] Intuition about "Discrete Latents" in paper about VQ-VAEs https://t.co/nw1kUkWvPc
[D] Regarding the Post 'Going Beyond ML Engineer', How to Actually Learn that before Jumping into the Industry? https://t.co/igP3xt8HsR
[D] Features for text similarity between requirements https://t.co/mvLO8pcDAy
[P] DALL-E Pytorch Demo (Include the video for Dall-e information) https://t.co/hUUsj31aYR
[R] [ICCV 2021] Gradient Normalization for Generative Adversarial Networks https://t.co/1hSvvHdBGo
“[Project]” Manual Annotation Tool for Relation Extraction https://t.co/Krr5WdwEj7
[D] Topos and Stacks of Deep Neural Networks https://t.co/f5DQTGL4MX
[D] Will the meta-reviews of NeurIPS 2021 come out on Sep 10th? https://t.co/I6tE8kSCnG
[R] 1000 class ImageNet classification with 20-bits!!! https://t.co/2tmpnUPCBx
[R] There can be no True Scottish Spoken Language System https://t.co/kKA3a2PtOG
[D] Unsupervised Learning Method that Provides "Class" Probabilities https://t.co/XxbmidXVJX
[R] How machine learning will revolutionise physics simulations in games? https://t.co/8MHA9RNi2m
[P] AI engines aggregator (Amazon, Google, Open Source, etc.) https://t.co/bWCENVGmtx
[P] Playing Battleship with Bayesian Search Theory, Thompson Sampling, and Approximate Bayesian Computation https://t.co/TtQbZu4BeB
[D] RNN unbiased sampling https://t.co/iZkOCPd71O
[N] Salesforce Open-Sources ‘WarpDrive’, A Light Weight Reinforcement Learning (RL) Framework That Implements End-T… https://t.co/wfIV0Zkvev
[D] Feature Store with highly dimensional data (text vectorizers) https://t.co/3Vh2o5SuZc
[R] Cambridge U &amp; Facebook’s ProoFVer: High-Performance Natural Logic-Based Fact Verification With Explainability https://t.co/BnWQc5MH7R
[D] Details of the Metropolis-Hastings Algorithm https://t.co/ekc6WGQmZr
[D] Weights system idea for kNN https://t.co/uM5gs4mWyZ
[P] LabelFlow is live! The open image annotation and dataset cleaning platform https://t.co/MrIiKK3rUn
[D] What are the most common ways to collect large quantities of image data for ML? https://t.co/IT6CZORs5I
[D] The loss and training from anchor boxes https://t.co/IRnCiPLEyV
[R] DeepMind’s Collect &amp; Infer: A Fresh Look at Data-Efficient Reinforcement Learning https://t.co/g5B9Gr2rti
[Discussion] What's the rational behind encoding a single input as a distribution over the latent space in VAE? https://t.co/RYACCvYsDY
[D] Residual Blocks in deep networks https://t.co/mYYYvNiRKf
business Intelligence [d] https://t.co/zE596DbfWH
[D] Understanding how higher lambda makes coefficients close to 0 https://t.co/75qhMRhWrn
[D] Understanding AdaDelta and RMSprop beta value https://t.co/UbjO975Eai
[D] Colab Pro no longer gives you a V100, not even a P100, you now pay for the (previously free) Tesla T4. https://t.co/3PAEaPg5x7
[N] Just released the most powerful social media BOTNET (Brief Demo) developed for CISA (Dept. of Homeland Security) https://t.co/vdFWyzyfZ6
[D] Is Training of Vision Transformer Models Self-Supervised? https://t.co/50xFifiQDE
[D] Autocorrelation in noisy data https://t.co/2UcpWuJBx4
[D] ML R&amp;D mailing lists? https://t.co/AnBAMNkQrN
[D] For those of you training machine learning models for corporations, how long does it take for you to train a mo… https://t.co/yXK5Z7HGmw
[D] Neural density modelling - overfitting &amp; metrics https://t.co/dwnqvLwlE0
[D] What software do I use for instance segmentation annotation? https://t.co/lnTwK8B8pT
[R] GLASS: Geometric Latent Augmentation for Shape Spaces https://t.co/mF8SRo672B
[P] Generating flashcards for most pages on the internet with T5 + RoBERTa https://t.co/DTMKZdDm5a
[D] Modified Huber loss https://t.co/7wfNqbudH8
[D] Are there any good free online text to image services that are accurate? https://t.co/YoM9i0J9R4
[D] Question related to controls projects using ML https://t.co/G4SGqYOHYK
Graph Clustering using Random-Walk Similarity (Research Paper Walkthrough) [D] https://t.co/WuFkZlt8at
[N] Stanford Open-Sources Differentiable Medical-Quality Human Physics Model https://t.co/eLByJM98IV
[D] Where can I read about feature engineering for regression models? https://t.co/1XUfWBLHNw
[D] Convoluted neural network vs decision table or q learning https://t.co/ODCPo3dvlH
[P] Building model to extract keywords from legal documents https://t.co/8Dw0arw8Iw
[R] UCSD &amp; Microsoft Improve Image Recognition With Extremely Low FLOPs https://t.co/ThHE6ENvnP
[D] [R] Is adversarial attack common in industry? https://t.co/n3a2BiyqOH
[N] Hod Lipson "Should Self-awareness And Self-replication Be Aligned In Evolutionary Robotics Design?" https://t.co/E5VB7At9kf
[P] A 3D Volleyball reinforcement learning environment built with Unity ML-Agents https://t.co/vXbUFxM8hE
[P] Real-ESRGAN: Training Real-World Blind Super-Resolution with Pure Synthetic Data Huggingface Gradio Web Demo https://t.co/bbFhClUVdA
[Project] Future of Lego! Turn any 2D image you have into Lego (3D model)! https://t.co/uBe0j6CK8l
[R] The paper deep crowd counting research deserves, but not the one it (seems to) want right now. https://t.co/Su5QOTU791
[D] What do you need to create a machine learning model or script to make a robot arm perform a task? https://t.co/sPG689SWNN
[P] A week ago, I came across this super cool project to build Cross Modal Search. I will now share more details ab… https://t.co/W4qAUuR8Nl
[D] machine learning based approaches for state space modeling https://t.co/qry6rde8pT
[D] Thoughts on Tesla AI day presentation? https://t.co/FXLlTcaG24
[P] Auto trigger bot for CS:GO in Tensorflow Keras https://t.co/unSGavh564
[D] How to adequately augment data for Object Detection? https://t.co/2blUKIOuKq
[D] Ways Machine Learning Can Be Used In Finance https://t.co/rO7AiPJq96
[P] Facial Recognition with AWS Rekognition or Azure Vision https://t.co/bV7RC4K2fj
[Discussion] Look for service to upload a model and receive a REST API endpoint, for serving predictions https://t.co/ycjdizHE0z
[D] Enterprise AI Adoption Journey - Why your business should opt it https://t.co/W6CpMq9Q9f
[R] On the Opportunities and Risks of Foundation Models https://t.co/uIcwNdDBBY
[D] Why does the NeurIPS format seem to not be yielding the same discussion as ICLR? https://t.co/TbHhBvx6tB
[D] Kubeflow vs. Argo for ML Pipeline Tool https://t.co/4I0n4TZWrz
[N] Gym 0.19.0 (the first big maintenance release) is now out https://t.co/fuyISDxHVW
Unsupervised vs meta learning [D] https://t.co/eTi2kjMEHq
[D] Coursera/Edx Online Master's Degree Experience https://t.co/h1S7iBPeFH
[N] Facebook AI Unveils UVO, A New Dataset To Boost The AI Research On Open-World Segmentation (An Important Comput… https://t.co/VMzwCpV5Kj
[Project] Efficient and scalable Graph Neural Networks papers https://t.co/zF1mbp8R9D
"[Discussion]" How to handle categorical and continuous variables in a regression problem? https://t.co/PWAHRkq0zS
[R] Tel Aviv Researchers Propose An AI Method Using Neural Networks To Generate A Face Universal Key To Imitate The… https://t.co/jzhIvuHYJn
[Discussion] What's the most innovative use case for GPT-3 that you've seen? https://t.co/VI3Ocq2s2M
[R]3D volumetric rendering with NeRF https://t.co/9N00Er3VX0
[D] Performing Instance and Semantic Segmentation with just 2 channels (edges + labels)? https://t.co/chkbvv8avS
[R] A Stealthy, Robust, General, Invisible and Flexible Adversarial Attack Method https://t.co/7vX6oUA5wn
[D] What's the minimum number of hidden layers a deep model at least has? https://t.co/5sCIy5Vinv
[D] Google Colab is now offering a 50$/month Colab Pro+ subscription tier https://t.co/Mx7uAXOiCW
[R] WMT21 | Detailing WeChat AI &amp; Beijing Jiaotong University’s NMT System Architecture https://t.co/bxZIi5JvmB
[Help][D] Fresh PhD student looking for current research topics to start off with https://t.co/PugTKlxvf0
[P] WeMoov: Automatic Calorie Counting Using Your Webcam - Turn Any Video into a Home Workout https://t.co/wRatAko1q6
[R] Tokyo U &amp; Preferred Networks Propose a Fast Estimation Method for the Stability of Ensemble Feature Selectors https://t.co/s15ok6x2VT
[D] Dice loss vs dice loss + CE loss https://t.co/2Q5hdGO0Yz
[D] Any open source implementations of Sendik et als multi/K-modal GAN aka MM-GAN? https://t.co/asWvZdlKCg
[D] Is active learning not needed anymore ? https://t.co/C24brI6UnF
[R] Sketech Your Own GAN https://t.co/ozuj3i6nfW
[D]Tutorial on shipping large model to production https://t.co/LDGBE66psH
[R] Optimizing F1-score proxy as a loss function at multiple thresholds? https://t.co/DXELeduMRR
[R] Make Every feature Binary: Microsoft’s 135B Parameter Model https://t.co/GeYzMVQQwj
[D] Predicting number of people with a certain job in a country https://t.co/08vfwujTgm
[N] Some of the Best AI R&amp;D papers/tools on Computer Vision News (with code!) - August 2021 https://t.co/mhzcQpOGYe
[R] HKUST AI Researchers Propose A Novel Neural Framework For Video Inpainting By Overfitting A CNN (Convolutional… https://t.co/1XdPEitOe5
[D] The language detection (from text) problem https://t.co/4Uf7O4TWfK
[R] How to avoid machine learning pitfalls: a guide for academic researchers. Covers five stages of the machine lea… https://t.co/seDhs15Ikj
[R] CMU and MIT AI Researchers Present A New Method To Sketch Your Own GAN With A Pencil https://t.co/ydSMuOKoB6
[D] What exactly is the kernel machine bottleneck? https://t.co/OlTd4Ksjzc
[P] Open Sourced a Machine Learning Book: Learn Machine Learning By Reading Answers, Just Like StackOverflow https://t.co/QaC27atqJF
[P] Mobile Object Detection - Transfer Learning in Tensorflow.js https://t.co/gq81eIb9Ee
[D] question about CBO AWS ML AI chatbots of torture and death by psychotherapist meds… https://t.co/BIxEkwwQ54
[P] Public-facing AI art gallery: CLIPDraw implementation using Gradio + Comet https://t.co/GFqfwSRO5T
[R] Struggling to reproduce perplexity benchmarks of Language models https://t.co/I2o0fnZSY7
[D] Would make sense to use unsupervised label for supervised learning? https://t.co/MC1baZ2yOH
[D] LGBM vs. XGBoost for Multiclass Classification: XGBoost error constantly decreases but LGBM only increases https://t.co/MNeQRhsZiJ
Uses of ML in healthcare [D] https://t.co/HCGXhSrZVq
[D] AI Challenge for Industrial Control System Threat Detection https://t.co/lxI1BKUZod
[R] DeepMind &amp; Google Use Neural Networks to Solve Mixed Integer Programs https://t.co/IogyPptZZn
[D] Val loss fluctuation based on scheduler fluctuation is a normal thing? https://t.co/yttolNjnJg
How to minimize luck and randomness while tuning hyperparameters? [D] https://t.co/Lypp6fHbnc
[Research] How to mix continuous and discrete categorical signals in LSTM-Autoencoder or other anomaly detection me… https://t.co/QpjB7Ht6DO
[D] Looking for a research I once read about "restricted SVMs" --- using SVMs for generation https://t.co/PEKAYWkyDF
[D] PhD for current engineer? https://t.co/J206n0km0Z
[R] Demystifying Neural Language Models' Insensitivity to Word-Order https://t.co/JlhT5uv6qZ
[D] Does the following function have a derivative? https://t.co/7UhtPNAz4X
[R] Apple’s Machine Learning Team Introduces ‘Hypersim’: A Photorealistic Synthetic Dataset for Holistic Indoor Sce… https://t.co/VzDUwo1oUq
[P] This person Couldn't find an internship so he built an AI Robot Hand https://t.co/4077Y0koAd
[N] Open-source code for training CLIP https://t.co/HqwmPRvGjr
[D] How software engineer get into machine learning job role? https://t.co/gLYyL9kTDY
[R] Accelerating Quadratic Optimization Up to 3x With Reinforcement Learning https://t.co/1GEKuclLnN
[D] "Low-ranked" journals and conferences https://t.co/Ez95NA0Dyc
[D] Speech-to-Text: Proprietary VS Open Source https://t.co/aP1wxMtFbc
[R] Google &amp; Northwestern U Present Provably Efficient Learning Algorithms for Neural Networks https://t.co/3y4Gmopvhw
[P] User-based Collaborative Filtering for movie recommendations https://t.co/NU566hGoy4
[N] Want to work on climate? ~30 talks published from conference on commercial applications of ML to climate change… https://t.co/tUgbX6BaxO
[D] Handling mixed data with different algorithms https://t.co/1JQEY8xXU3
[D] Any paper/CV applications using Huber loss instead of L2 loss and have a great improvement? https://t.co/3rQ7O2AEAv
[D] It is important that the training data of a chatbot differentiate between interlocutors? https://t.co/atmuuTDCjv
[R] Go Wider Instead of Deeper https://t.co/6jYq25a7E0
[R] Simon Says: Evaluating and Mitigating Bias in Pruned Neural Networks with Knowledge Distillation https://t.co/tBi3v8wb8E
[D] noise in the data https://t.co/EPqs0hQqiV
[R] (XAI) NICE: A fast and reliable algorithm for counterfactual explanations https://t.co/q8z9M4ItkJ
[D] Regression on noisy observed data https://t.co/i2p3YdqHav
[D] Inverse of Event Detection - Temporal Disruption Analysis https://t.co/Zio814SP6o
[R] Looking for interview participants with data science collaboration experience https://t.co/bfHyONtSwN
[D] Learning respresentation of multimodal input independently using a single model https://t.co/Sccm5X0GLg
[D] Why haven't researchers investigated networks with varying timescales of adaptation, even after Hinton, Bengio,… https://t.co/d3ZVON8ypS
[P] Text Clustering to Classify Land Parcels https://t.co/0hDX9U7kXf
[D] False Negative Rate Loss https://t.co/IR8KAtydT1
[D] What causes good classification but bad emebdding clustering? https://t.co/9mUBEihAVP
[P] Remove background from video and image using machine learning, open source https://t.co/eivkigEJp3
[D] An Ugly Truth - Why Facebook can never fix itself? - Is the ML / DL community hypocritical? https://t.co/TupwRuMIHj
[D] Love machine learning, but hate reading papers. Is there a job that lets me just work on using/applying models,… https://t.co/UmH6KVoKtk
[D] Are there any speech to speech voice cloning models (speaker to speaker voice transfer) https://t.co/wbLcO5541D
[D] What are the barriers to implementing body tracking with mobile devices? https://t.co/3F5YZqz3Ao
[R] Facebook AI Introduces few-shot NAS (Neural Architecture Search) https://t.co/AwvxV592j7
[R] A Reinforcement Learning Environment for Mathematical Reasoning via Program Synthesis. We converted the DeepMin… https://t.co/J6uE9ZBa1c
[D] Are the claims correct? Are decision trees "inherently better" at handling categorical variables? https://t.co/6XnRWOYOIB
[D] Community Outreach Suggestion with r/3Dprinting https://t.co/yDm0ffjc6W
[N] NVIDIA Launches TensorRT 8 That Improves AI Inference Performance Making Conversational AI Smarter and More Int… https://t.co/f9ZNXWaGKM
[D] Importance of Convergence Proof for Gradient Descent https://t.co/hSGXWN4GTt
[D] Splitting large dataset into two sub-sets, training on each separately, then fusing together. https://t.co/RP6G7Lxe1D
[R] Deep Learning over the Internet: Training Language Models Collaboratively https://t.co/CT2CxvaFWu
[D] How is the accuracy of a computer vision algorithm measured? https://t.co/IYmc6PdlGc
[D] What OOP/design principles/coding best-practices do you utilize on your machine learning/data science projects? https://t.co/4WV4j1soR8
[Project] Newsemble: An API to fetch current news data https://t.co/RT5rIUp16Z
