[N] AMD launches MI200 AI accelerators (2.5x Nvidia A100 FP32 performance) https://t.co/3BkadSZfyv
[R] Introducing MetaICL: A Language Model Meta-Training Framework for Few-Shot In-Context Learning https://t.co/OJ289EhiLl
[Project] Google MoveNet (Real-Time Pose Estimation) Used To Control Nintendo Punch-Out!! https://t.co/vn0ZXdQeZQ
[P] HuBERT: How to apply BERT to speech, visually explained https://t.co/p8Jlku3WO0
[R] A Unified View of Relational Deep Learning for Polypharmacy Side Effect, Combination Synergy, and Drug-Drug Int… https://t.co/km22lA5NyZ
[Project] JORLDY: OpenSource Reinforcement Learning Framework https://t.co/jNI9cavuii
[P] Open-NSFW 2: TensorFlow 2 implementation of the Yahoo Open-NSFW model https://t.co/xGO4mMtTAH
[D] New in-depth AI interview episode out! Tristan Zajonc's AI startup just came out of stealth mode already doing… https://t.co/X9OepQVTTh
[R] StyleCLIPDraw: Coupling Content and Style in Text-to-Drawing Synthesis https://t.co/8HK5wSSeEk
[R] Check the blog that introduces our recent #NeurIPS2021 work on nonconvex stochastic optimization! We propose st… https://t.co/wDOsL0wEpB
[P] Need some help with For Loop in AI-Body-Detection https://t.co/YENpSjJK6y
[R] Lucid Sonic Dreams W/ StyleGAN2 https://t.co/ZIHVGKmmUe
Climate data downscaling using machine learning e.g. precipitation [P] [R] https://t.co/nszfYSadlx
Large number of features vs ensembles [D] https://t.co/B0jjFfQ9Bb
[D] What happened to Compressive Transformers? https://t.co/0RQWytl0Iy
[D] Do you want to learn GANs? A generative modeling quickstart guide by Casual GAN Papers https://t.co/TXRl4sZ9SK
[D] Algorithm for Least Cost Route https://t.co/p6XMHlESVV
[D] What are good resources for Software Engineering principles in big ML projects? https://t.co/kBEZsiitLU
[D] Text analysis/topic modeling technique for finding differences between predetermined groups of documents https://t.co/R5O4QjbwbM
[N] State of AI 2021 https://t.co/XEsmkKHaNT
[D] Simple Questions Thread https://t.co/1mm4WXIAO9
[D]What is something you took the time to learn that benefitted you the most? https://t.co/z7vV2uX1C7
[D] Machine Learning Visualization Tools and Resources https://t.co/FUBELcwVYy
[R] stl file data annotation https://t.co/X61MgdZK1z
[D] Measure the distance between two domains for transfer learning. https://t.co/bJjDZIvZmv
[Discussion] MLops tool for image data management and exploration https://t.co/EKZfvO85FL
FLOPS Calculation [D] https://t.co/we2UkyI8hp
[R][P] 2021: A Year Full of Amazing AI papers - A Review [work in progress...] A curated list of the latest breakth… https://t.co/TfVn1BQraG
[Discussion] Looking for a laptop for ML purposes https://t.co/G8bKSyRfTU
Comparing deep models with different complexity and different accuracies [D] https://t.co/KJDZ3T0pUj
[P] Multimodal Network for Video Classification https://t.co/MBEW86GH2v
[News] See all available public code implementations for any AI/ML paper you come across on Google, Arxiv, Scholar,… https://t.co/QcxF9pqqhc
[D] Bias, consistency and designing KPI’s for data-driven endeavors https://t.co/kE3czAIw7i
[R] A (rare) real example of a true time series anomaly discovered by an algorithm. https://t.co/2PiadQuo5O
[P] Is it necessary to manually label desired objects in each image for object detection? https://t.co/4P1cc1hu9x
[D] Feed Forward Network Trying to solve by hand https://t.co/GYRZ1V9Cws
[D] The easiest way to go from Jupyter Notebook to desktop app? https://t.co/chWw9LEfs5
[D] GPT-3 is No Longer the Only Game in Town https://t.co/NFPampaB80
[P] Problems with a Neural Networks's Output's Order of Magnitude https://t.co/winmQ90SAl
[R] Unsupervised Learning of Compositional Energy Concepts https://t.co/D46jlHewnv
[R] [P] AnimeGANv2 Face Portrait v2 https://t.co/Jj0kBrTjer
[Discussion] How a CNN with decreasing filter size layers works against the increasing filter ones? https://t.co/BKOhgR8uAL
[D] Professors and research groups in Neural program synthesis https://t.co/lKc095X3qF
GPTSD - Transfer of trauma from human to machine back to human via machine learning models [P] https://t.co/UcceJIvEM3
[D] According to google and AWS these are very NSFW... I want it on a shirt! https://t.co/FPtioXrOf4
[Research] Looking for interesting machine learning papers to read over the weekend? Here is a curated list I made… https://t.co/1anDs1TOP7
[D] Google MUM details? https://t.co/6RtIMG8RdA
[D] Help: Choosing right data/file format for Storing Text Data https://t.co/NvpkjdSKlV
[R] Is CVPR really only for computer vision? https://t.co/rrFetG6FDg
[R] Adversarial Intrinsic Motivation for Reinforcement Learning https://t.co/EZdpzWrIVh
[R] Hiring Developers on Upwork https://t.co/Lcs4RfmN05
[D] "Real-World Challenges for AGI" by DeepMind https://t.co/R5FUSh2JX4
[R] Arch-Net: A Family Of Neural Networks Built With Operators To Bridge The Gap Between Computer Architecture of A… https://t.co/SIuOiPhoxI
[P] Open-source project to collect data from multiple databases, apps, SaaS tools and prepare for ML tasks https://t.co/OUkcpy9EYm
[D] Smart city https://t.co/aHEnGtivQg
[P] League of Legends Patch 11.21 Game Playing AI (Reinforcement Learning, Supervised Learning) Dataset https://t.co/yHAa35yM6O
[D] How do you structure your CV? https://t.co/xmfQRKhdiF
[P] A place to create your online data science portfolio and browse the community data science projects https://t.co/9evISL8BE1
[D] CVPR: Policy for posting on arXiv https://t.co/RYWgxQTf0u
[N] TF/Keras in Hugging Face, Datasets Edition https://t.co/fBslNgWXKc
[P] Transformers from Spin Models: Approximate Free Energy Minimization https://t.co/T1lOZtDB0y
[D] Putting ML models in production https://t.co/V9wRCtZri7
[P] Demo: Chatting with Gandalf using GPT-J-6B https://t.co/DTviwe2XPq
[R] Supervised learning and other branches of machine learning https://t.co/yH9vtFtMgr
[D] ONNX ecosystem https://t.co/g0SlLXtkRh
[D] Experiment Tracking Today: What do you use? Pros and cons. https://t.co/SsQjPCHCLa
[P] Mosec: deploy your machine learning model in an easy and efficient way https://t.co/AMCK30NCDD
[P] List of ICLR 2022 submissions that People are Talking About. https://t.co/TQMuRVLtN1
[P] An illustrated tour of wav2vec 2.0 https://t.co/5JFyvWoIG3
[D] The four fundamental interactions of transformers https://t.co/FZYKbqXOpb
[R] Federated Learning - A decentralised form of Machine Learning https://t.co/XPyDRCzaWE
[R] Dynamic Execution/Dynamic Inference Repos? https://t.co/xRz78zY8cu
[R] The Role of Permutation Invariance in Linear Mode Connectivity of Neural Networks https://t.co/RgUic09l0z
[P] StyleGAN3 + CLIP https://t.co/8A1gl4Wm4o
[N] Cambridge Quantum (CQ) Open-Sources ‘lambeq’: A Python Library For Experimental Quantum Natural Language Proces… https://t.co/rD7GFz7hrv
[D] Production Model Monitoring - What are you using? https://t.co/Z3HkAt16oA
[D] Paper explained - StyleNeRF: ICLR 2022 submission (5-minute summary) https://t.co/zxCj50Z1hM
[R] Open-Set Recognition: A Good Closed-Set Classifier is All You Need https://t.co/BuxKD2bIwG
[D] Master’s Thesis in ML, stuck between topics https://t.co/2Dze2r9Wxp
[R] ICCV2021 oral paper -- Unsupervised Depth Completion with Calibrated Backprojection Layers improves generalizat… https://t.co/JRZHMjTUa0
[discussion] OS and Infrastructure for MultiModel Production https://t.co/QfsbnNgDFK
[N] Microsoft and NVIDIA AI Introduces MT-NLG: The Largest and Most Powerful Monolithic Transformer Language NLP Mo… https://t.co/yUl9Uj6qIH
[D] Tired of writing mundane data wrangling code. https://t.co/D3z5zoHnhJ
[D] Video coloring SOTA https://t.co/Jzc2L8A9vN
[P] Looking for advice in BSc thesis - evolution simulator https://t.co/rlMsbxQxrF
[N] Webinar announcement: First Open-Source Data Discovery and Observability Platform for ML Engineers https://t.co/LqFwxl1KbJ
[Discussion] Course recommendation https://t.co/YfGTrtg1B1
[D] Improving picture focus/noise in very constrained dataset https://t.co/9kuACtukhX
[D] How Do you Evaluate your Rendered Synthetic Data? https://t.co/Ab6J0lyM2h
[D] Suggestions for the most powerful PC in 5K USD budget? https://t.co/6VCBneWdSg
[D] What exactly is the context representation in wav2vec 2.0? https://t.co/DwUsJENJXU
[R] DevOps eBooks Bundle from Packt https://t.co/ofwr5weDmp
[D] Conditional Generative Models https://t.co/kY5EpU3cat
[Discussion] What are the problems you face as ML Practitioner and what tools do you use to solve for those problem… https://t.co/8mukUiWjL6
Schmidhuber pays tribute to Kunihiko Fukushima for winning the 2021 The Bower Award for Achievement in Science, for… https://t.co/SSvFVlS2Zg
[D] Pre-train, Prompt, and Predict: A Systematic Survey of Prompting Methods in NLP (Paper Summary) P.1 https://t.co/BHaDpvRT7z
[P] Transformers from Spin Models: Approximate Free Energy Minimization https://t.co/ospkyf3WCN
[R] Go-Blend behavior and affect https://t.co/uRgkv8uN3j
[R] Chaos as an interpretable benchmark for forecasting and data-driven modelling https://t.co/g4MzW8C7ax
[R] A Few More Examples May Be Worth Billions of Parameters https://t.co/9rbG57hGmj
[P] Our lab released a unified prompt-learning toolkit #OpenPrompt, which aims to make it easy to deploy prompt-lea… https://t.co/5w0F7OVXpC
[R] Relative Molecule Self-Attention Transformer https://t.co/tjHdAsk4uv
ABO: Dataset and Benchmarks for Real-World 3D Object Understanding. The "Amazon Berkeley Objects" dataset is a larg… https://t.co/k5eUseKN2V
[R] Vectorization of Raster Manga by Deep Reinforcement Learning https://t.co/WFJGj0G61L
[D] Can an algorithm that query and update a knowledge graph be enough for a high level AI? https://t.co/ngYO9f0ant
[D] Text summarization for learnable content https://t.co/Nd2T1JoVNA
[R] Has GRAD-CAM been superseded? https://t.co/QGOQHzWJGZ
[P] Creating a new ML algorithm or improving an existing one https://t.co/jOYEvE9AuR
Reinforcement learning for recommendation systems [D][P] https://t.co/IjuXU9ZHVx
[R] Facebook AI Introduces ‘3DETR’ That Increases 3D Comprehension and ‘DepthContrast’, A self-supervised Learning… https://t.co/R4Pe2FvQ8v
[R] AI Research Group From NVIDIA Unveils An Advanced Framework To Estimate Physically Correct Human Motions https://t.co/XPA6xve75w
[P] Vizcom - ML enabled creative tools for artists and designers https://t.co/wX2EWDpRht
[Research] Mark Data for Decision Trees and Reinforcement Learning in Mt4 or Mt5 https://t.co/iISByiAzWE
[D] Motivation of Contrastive Predictive Coding https://t.co/Jwp2017w4u
[N] 100X Better Detection Accuracy Achieved with ALIIS https://t.co/3toflfW9WM
Techniques for getting Graph Embeddings from Node Embeddings [D] https://t.co/1v51VRleUI
Choosing Ensemble Algorithms [R] https://t.co/b08vqwHtDs
[News] VGPNN: Generate Video Variations - No dataset or deep learning required, Only Nearest Neighbors! https://t.co/tIka8E5i3t
[P][D] Simulation: Life as a Survival Optimization Problem Complicated by Local Maxima https://t.co/gB3tDSRbyW
[D] I need a transformer... https://t.co/nI9PJp1ahP
[D] SVM with Stochastic Gradient Descent https://t.co/2BlBwCPqtX
[R] Scale Efficiently: Insights from Pre-training and Fine-tuning Transformers https://t.co/UIOSrdmEnn
[R] LoFTR: Detector-Free Local Feature Matching with Transformers https://t.co/fVfuHfprrj
[D] Cost Benefit Simulations https://t.co/OzW5ChSqLS
[R] Pix2seq: A Language Modeling Framework for Object Detection. “We simply cast object detection as a language mod… https://t.co/ihsKHOKKNu
[N][CfP] AI for Design and Manufacturing Workshop (ADAM) @ AAAI 2022 https://t.co/hER4QbwmEs
[D] Good papers on artificial creativity and imagination? https://t.co/ebd8uxBIVQ
[R] Recursively Summarizing Books with Human Feedback https://t.co/B99afPYkFg
[Project]Best way to generate 2D datasets from 3D images? https://t.co/kCwOUsSaiY
[D] Do you know any open-source video classifiers? https://t.co/2sEpwS4VLa
Assisting the Human Fact-Checkers: Detecting All Previously Fact-Checked Claims in a Document https://t.co/3Zufy9F95B
[D] PhD Thesis Committee https://t.co/JLNqpgvjiv
[D] NeurIPS archival workshops? https://t.co/bQTVpNlY5Y
[N] BITS AI Symposium 2021 https://t.co/fQ0RiluJ7b
[D] Thinking of Quitting an ML PhD - Chances for another PhD position? https://t.co/TeXhIgtKA8
[R] Google’s Zero-Label Language Learning Achieves Results Competitive With Supervised Learning https://t.co/dNQvMHGFjS
[Research][Project] Muzic, an open-source research project on AI music, by researchers from Microsoft Research Asia https://t.co/bUYY75W6tE
[D] Libraries and ML Algorithms to build and learn from Tree-structured data? https://t.co/NDPIEh97kI
[Research] Training times of modern YOLO-like networks? https://t.co/Exfm37F6ga
[D] GAN loss functions https://t.co/MBcoirP0UU
[D] Successful examples of using a VAE encoder for a downstream classifier. https://t.co/bGBg8OWuI4
[D] Schmidhuber's critique of the 2021 Turing lecture https://t.co/8qMOGXFqMC
[D] VQgan + clip for AMD GPUs https://t.co/pASmMZD2py
[P] [D]How can i achieve a Machine learning program which predicts jobs market and technology trends? https://t.co/H6cgHhGw0P
[D] Best web framework in 2021 for Data Science Apps https://t.co/8FNRzP7KDe
[D] I'm having trouble creating large dataset (.csv file with employee details) https://t.co/NNQsY8i6UC
[D] Are there any Quacks and Charlatans in AI Research? https://t.co/h2q8bbop70
[D] (Paper Overview) Pix2Seq: A Language Modeling Framework for Object Detection https://t.co/PnrZDvatNy
[D] Ranking top companies, universities, and countries by ICML and NeurIPS accepted papers https://t.co/8Ufhh083vc
[D] Next Frame Prediction Running Live On GPU https://t.co/yyHtLdgpQ6
[D] ONNX Runtime Web https://t.co/c35uz8IfTP
[R] Physics-based Human Motion Estimation and Synthesis from Videos (ICCV 2021) https://t.co/cNngylUEdA
[D] What is the best openly available GPT3-like model (i.e. zero shot NLP)? https://t.co/iNeaGvCniq
[D] Where does the 128 come from? https://t.co/9xcb6V6nza
[D] Tool for annotating and seeing other annotations of papers in the cloud https://t.co/0p3H88NzGh
[R] Introducing Symmetries to Black Box Meta Reinforcement Learning https://t.co/7mw4ibTtet
[D] How do you ensure reproducibility? https://t.co/RBaWEyNW5j
[R] Scaling Laws vs Model Architectures: How does Inductive Bias Influence Scaling? An Extensive Empirical Study on… https://t.co/IgkobGE50S
[D] GSN Paper Explained - Unconstrained Scene Generation with Locally Conditioned Radiance Fields (5-minute summary) https://t.co/syefMtqwDa
[R] Google AI Introduces ‘WIT’, A Wikipedia-Based Image Text Dataset For Multimodal Multilingual Machine Learning https://t.co/EpfcX016hB
[D] How do you manage your ml models that require a gpu in production? (Question) https://t.co/6pKW8mEDit
[R] Scaling Laws for Neural Machine Translation https://t.co/Cuv1W5yhJb
[N][R] Want to leverage synthetic data for 3d reconstruction, but don't want to deal with the photometric domain ga… https://t.co/2KLf8mx92Z
[R] what happens if you use Bayesian filter before object detection in tracking https://t.co/mopgSNPv8m
[N] Open Sourcing Checkpoint 🛂 https://t.co/Ib3ithv42s
[D] Probabilistic Modelling of Large Count Data https://t.co/yxuaEzF2N1
GraphSAGE: Inductive Representation Learning in Large Graphs (Paper Walkthrough) [D] https://t.co/WHOudqsXp0
Does anyone know what ML/Neuro project Google X is working on? [D] [T] https://t.co/27veAyy2F0
[D] Discussing abductive inference with the author of "The Myth of Artificial Intelligence" https://t.co/TKkoSdahnp
[D] Significant differences in Training on 1 GPU vs 8GPU ? https://t.co/b9pCoM7SNs
[D] Object-NeRF Paper Explained - Learning Object-Compositional Neural Radiance Field for Editable Scene Rendering… https://t.co/z5NYjymy3h
[D] Questions About Cross Stage Partial Networks (CSPNet) https://t.co/W6wLsHlcLF
[D] Geometric Deep Learning Blueprint (Video on MLST) https://t.co/AsjyaQmOeU
[D] Can someone please suggest how to begin working on a problem like this? https://t.co/UcqTAvqAPD
[D] Controllable Generation from Pre-trained Language Models via Inverse Prompting (Paper Summary) https://t.co/tqG5zA3x9N
[R] Scalable Open Architecture for Embedded Edge (SOAFEE) https://t.co/0LPvKpUxKV
[D] What makes a paper good? https://t.co/9czdcr79A1
[D] Understanding Lagrangian in SVM https://t.co/aageeDgMzp
[R] Slides and Videos of ICML 2021: Thirty-eighth International Conference on Machine Learning (… https://t.co/G9owMV5bq0
[D] Submit to two conferences at the same time https://t.co/gGP5LUbe7F
[P] TFServingCache: A distributed LRU-cache for serving TensorFlow models in Kubernetes https://t.co/pX8sjuieIa
[D] Deep learning equivalent of Bogosort? https://t.co/6kzp3XQCEN
[Discussion] Any advanced NLP tutorial to refresh a veteran's memory? https://t.co/zvepgBqIz9
[D] NeurIPS 2021 DeepRacer Challenge launched. https://t.co/YvDpn3Bzy2
[R] CMU, Google &amp; UC Berkeley Propose Robust Predictable Control Policies for RL Agents https://t.co/PDpTfJ3AtB
[D] Google-AI FLAN Paper Explained - Finetuned Language Models Are Zero-Shot Learners (5-Minute Summary) https://t.co/rZMKikvcxB
Best Algorithm to Use for Proposed Framework/Problem? [R] https://t.co/dxO7G1PGy1
[R] Good book/resource on probabilistic graphical models/Bayesian networks? https://t.co/weDIZWxPVM
[R] Using Triplet Loss and Siamese Neural Networks to Train Catalog Item Embeddings https://t.co/rrwKd8tI9n
[D] State of PyTorch Core - September 2021 edition: A summary of the core features that the PyTorch team is working… https://t.co/BYTj16xvY4
[R] What Changes Can Large-scale Language Models Bring? Intensive Study on HyperCLOVA: Billions-scale Korean Genera… https://t.co/ZBBbgUx5DF
[R] Bootstrapped Meta-Learning https://t.co/yp4cYa3TZ1
[R] Feature selection algorithms for psychometric questions when the predicted variable is multi-dimensional? https://t.co/t9dzywC7GB
[P] Using Deep Learning to draw and write with your hand and webcam 👆. The model tries to predict whether you want… https://t.co/gEk6a47kLq
[R] Deploying a Python machine learning app on Kubernetes https://t.co/TGH0srkZvc
[R] Unlocking Pixels for Reinforcement Learning via Implicit Attention https://t.co/b4Ek5Pd1A4
[news] Make Slow Motion Videos With AI! TimeLens explained: a new model for video frame interpolation published at… https://t.co/QEVLruBQQd
[P] Machine Learning working on the challenge of sepsis https://t.co/cJCu7pDrM7
[D] Does there exist a "purely qualitative" situation? https://t.co/xWdUaj6HQP
[P] Training a spiking NN to produce images https://t.co/XDTH3xf1Z0
