[P] Generative Inpainting API. https://t.co/vLfCIzPAxU
[R] A Catalogue of Bad Studies https://t.co/Jsa7VeSUgW
[D] 103 Top Machine Learning and AI Experts https://t.co/uVnaWz7JMX
[D] Applications of Advanced Undergraduate Mathematics Coursework to Machine Learning https://t.co/bBypVfWPSx
[D] Virtual ICML/NeurIPS/ECCV conferences, worth it? https://t.co/QopOWkyGdD
[D] What is the correct way to embed a graph with multiple edge types? https://t.co/VlzeFiKc0g
[Research] what are the communities thoughts on Synthetic data? https://t.co/ozi7wCGKCE
[R] "We've made a decision to plan for a virtual ICML 2021." https://t.co/9MfoJR6tYQ
[D] how does tensorflow.keras work with multiple GPUs? https://t.co/Ccnf7Uagt9
[D]After applying convolution, size of output? https://t.co/TdKKNYXNW1
[D] Capsule network https://t.co/YhN8EtOwjI
[P] codequestion: Ask coding questions directly from the terminal https://t.co/XPnhvPm6VO
[P] f-word detection project/dataset (but mostly dataset) https://t.co/Jj0HTbiCBz
[P] No idea in RL https://t.co/9KzHYM0bn5
[D] If I am trying to recognize a landmark from a video, given reference pictures of the landmark, what are some co… https://t.co/Vtyl1IhHck
[D] Will the 2080 Ti be faster than the 3090 for Machine Learning / TensorFlow? https://t.co/5FltnU2eff
[D]Should I build separate models for different populations? https://t.co/RMyIJgHfJF
[D]Did anyone try combining active learning with few-shot learning? https://t.co/9SvZjQflbt
[D] PhD Applied Maths useless in ML? https://t.co/LASL857ucy
[P] [Book Announcement] Approaching (Almost) Any Machine Learning Problem https://t.co/TexWlWWGK3
[R] Intuition and implementations for Gated Linear Networks from DeepMind https://t.co/6Vwm0Zhad1
[P] Art StyleGAN2 with crowd evolution https://t.co/JHi7A5iQH7
[N] STEMM CSAIL MIT AI in Healthcare Summit https://t.co/f7CreQ89jz
[D] If you were going to spend $3000 on the new 3000 series Nvidia GPUs for your deep learning machine what would y… https://t.co/tkeXOpm5as
[D] Has anyone used https://t.co/78ae77wmoy to test their ML/DL skills and further career prospects? https://t.co/OuqiM7h6IB
[D] Ways to scale up my home Machine Learning server https://t.co/Bid1mcsCd3
[Research] CVPR20 Oral: Satellite Image Time Series Classificationnwith Pixel-Set Encoders and Temporal Self-Attent… https://t.co/zfkh9cM1mA
[Discussion] What websites have interesting benchmark datasets with performance leaderboards? https://t.co/jYdQ4u27dI
[D] Resources on usage of Data Science for Enterprise Pricing Solutions https://t.co/Wku1ZuB6b5
[D] How many parameters are in the GPT-3 neural net used for AI Dungeon's free engine Griffin? https://t.co/CohJwuqwYK
[D] Azure Personalizer: Feedback/Opinions? https://t.co/1mVtqPmifA
[P] Manipulating Video with Example-Based Synthesis https://t.co/DATrhBPPwr
[Discussion] What kind of blog posts do you like to read on Machine Learning? https://t.co/SgrL3Kccdb
[R] DeepMind Uses GNNs to Boost Google Maps ETA Accuracy by up to 50% https://t.co/WwnC5bJ7YU
[R] Flow-edge Guided Video Completion - ECCV 2020 https://t.co/LZdIU5Nz7z
[D] What are some programming related research topics that can be solved using NLP? https://t.co/6GsbpfPnYe
[D] Choosing the right object detection model means looking at more than just mAP https://t.co/rCqkPn6ouL
[D] How to determine and quantify how "good" a cluster is? (VAE) https://t.co/wQAOFFgXHY
[D] Graph Machine Learning Newsletter Issue #2 https://t.co/TcmyOwjBuK
[D] Does anyone have any experience running their own crowdsourcing campaign? https://t.co/yQZc8pv1DX
[D] Methods for comparing the similarity between Spatial Trajectories? https://t.co/SpLNI9kE0E
I built a "Clean vs Messy room Classifier" which gives awesome result on validation &amp; test set by just training on… https://t.co/4xGH2fnlOq
[R] Microsoft Researcher Single-Handedly Surveys the SOTA in Sign Language Recognition https://t.co/puZEHy8Bvs
[D] STUMPY Version 1.5.0 - For Modern Time Series Analysis https://t.co/PA6NTrCFiE
[Discussion] Difficulty in implementing Softmax instead of Sigmoid for [0,1] Neural Network output layer https://t.co/vFmxCoxskc
[D] What do you use to queue up local jobs/experiments and define data flow/dependencies? https://t.co/hZ0JG2kRBg
[D] A crowdsourcing application https://t.co/D1ZI3cmKgf
[D] interpreting GPT: the logit lens https://t.co/QHydJDRI2S
Curriculum learning with CNNs [Project] https://t.co/GgLZo28wzs
[N] PyCon India 2020! https://t.co/1B08M8Vznu
[D] GAN to hallucinate binaural sound from stereo recording. https://t.co/PTwkz3oWjP
[D] What do you do when a paper makes a similar contribution but doesn't cite you? https://t.co/kmdvLrUK4V
Is it worth sacrificing some time to do undergrad research instead of practicing algorithms for ML Engineer new gra… https://t.co/xr9pP4XWJc
[D] Are there no pre-made algorithms for turning numeric classification results to geometric structures? https://t.co/0Iizc3ceaa
[D] Why is python the most popular language for Machine Learning programming? https://t.co/ghAaxJnCoq
[P] What are adversarial examples in NLP? https://t.co/FaNI82QJdp
[D] Why do so many (seemingly) non-research ML internships require PhD's or that you're a PhD student? And is that… https://t.co/BNqMfWXrai
[D] Could you restrain the number of targets in a YOLO-Deep Sort type of dual-algorithms when you know how many tar… https://t.co/B68yHnZ2Tj
[D] How to process large image arrays in python? https://t.co/MFJRfRp6sJ
[D] Do you think someone will use the arXiv Dataset and synthetize paper using language model that will be accepted… https://t.co/fzjnA1myk8
[D] Odd Questions Regarding Transformer (NLP) https://t.co/fWY3Onr4gz
[D] In theory, could a large neural network be trained and run on a decentralized, global scale? https://t.co/ggkOTsHelu
[R] 10 Free eBooks on Artificial Intelligence, Machine Learning and Deep Learning to read in 2020 https://t.co/lJNbmbpcsE
[R] Fewer Cameras and Faster Processing: USC Proposes Monocular Real-Time Volumetric Performance Capture https://t.co/cWpvRqi7Yp
[D] What is the tradeoff or relation between batch size and the number of epochs? https://t.co/Zp8s0SUPxc
[P] Identifying Tomato Species with YOLO on iOS devices https://t.co/bdAb0hzqBz
[P] Flow Forecast: An open source multivariate deep time series library in PyTorch https://t.co/lZ7XMigRnQ
[D] How to automatically disable register_hook when training model is in eval() phase in PyTorch? https://t.co/zUdhJVx6PC
[P] Advanced Artificial Limbs - AI_4_AL https://t.co/hTYHu4z534
Sample-efficient Cross-Entropy Method for Real-time Planning https://t.co/pbvOVGWTq6
[D] How to turn a colored image into lossless float32 one channel image? https://t.co/P1u3yfB8dx
[R] Learning Deep Networks on Noisy Data https://t.co/R56OieOoBU
[R] Sepp Hochreiter on Parallels Between Attention Mechanisms and Modern Hopfield Networks https://t.co/MXOQwHuaj6
[N] GPT-3, Bloviator: OpenAI’s language generator has no idea what it’s talking about https://t.co/PpaKnH0SzO
[P] Serve Your ML Models in AWS Using Python, a Wrapper around Cortex https://t.co/UO9vGQvgc6
[N] PyTorch Lightning V0.9 is live with Final API https://t.co/NXT7p28QTY
[R] free online Workshop on Equivariance and Data Augmentation, featuring talks by leading researchers https://t.co/NCalbe6h47
[D] State of the art in AI safety https://t.co/qkFhEErElx
[D] Recommender systems seminal papers? https://t.co/SWSiFupALm
[P] Looking for someone in academia to review the paper I have been working on. https://t.co/TYIPxFk3yO
[D] Is it legal to use models pre-trained on ImageNet for commercial purposes? https://t.co/77MDNACWkw
[D] How to combine two different embeddings in the best way possible? https://t.co/2Wk0Q2dDTR
[D] What Machine Learning methods do you use in your field/work? https://t.co/2Y4RvvFKCI
[D] Looking for advice regarding an investment into a co-working space focused on deep learning / ml / ai / autonom… https://t.co/umKvJ5ask7
[Discussion] How have Differential Neural Computers (DNCs) been used since their introduction? https://t.co/QsMHE9HoXZ
[R] Unbalanced segmentation dataset suggestions https://t.co/BoBha7JTQ4
[R] Experimentation during a pandemic https://t.co/hA0UYpeca9
[R] Code for Decentralized Reinforcement Learning: Global Decision-Making via Local Economic Transactions:… https://t.co/dyK9wMirYS
[D] How to know if the model has the potential for great accuracy before full training ? https://t.co/oTvoZkakiM
[Discussion] Consciousness in a Convoluted Neural Network: Ethical considerations https://t.co/hrnbJT2Xhw
[P] Access to 1,400 NLP Model Inference Code Templates https://t.co/peKvCtiGvG
[P] Titanic: Neural Networks made EASY with cflearn https://t.co/gjFoNj2uhi
[D] How do you think an AI Decrypto tournament play out? https://t.co/2yAzxXYtp8
[D] Knowledge discovery with GPT3 https://t.co/OFAITf42VD
[D] Is there a general way to suppress graphics calculation of games you don't have the source code to? https://t.co/FPYqhmCeLT
[D] Image Restoration AI - Upscale and Restore Faces with DFDNet https://t.co/9EXUKKuc2E
[R] Advancing Safety &amp; Privacy for Trustworthy AI Inference Systems https://t.co/AF65fQrWR3
[D] Paper Explained - REALM: Retrieval-Augmented Language Model Pre-Training (Full Video Analysis) https://t.co/AZqkXeGBlF
[D]Question about fast R CNN paper https://t.co/3ZeIOq1h3m
[P] Choosing an OCR https://t.co/5Ckr1Kd4BS
[R] Manifolds for Unsupervised Visual Anomaly Detection https://t.co/fT4FzTo5JQ
[R] On Feature Relevance Uncertainty: A Monte Carlo Dropout Sampling Approach https://t.co/xRQ7xjMiAk
[Discussion]Anyone working on explainability/interpretability for ML models based on timeseries data? https://t.co/JMQHtZWEfb
[R] 3D Drug-Target Interaction Dataset https://t.co/JQkHdczjnc
[D] Decision tree: A short hypothesis that fits the data is unlikely to be a coincidence https://t.co/TLPTVIniHj
[R] Aligning AI With Shared Human Values [GPT-3 on a new ethics dataset] https://t.co/Ye84lzu4Qg
[D] Graph Convolutional Networks for Relational Data https://t.co/C736QRszzE
[D]H-index Booster - Boost Our H-index Together! https://t.co/eubO2kzbgU
[D] How do you use ML as a hobbyist? https://t.co/WZ6IShOVyG
[D] Will Schmidhuber ever strike back? https://t.co/qxm9D8jMmG
[R] A critical analysis of metrics used for measuring progress in artificial intelligence https://t.co/5l9XzUdoGo
[D] Multi-person, multi-camera tracking https://t.co/pZk29NoWoD
[D] Matrix Profiles for Streaming Time Series Data https://t.co/XVaCJmDhZP
[R],[D] Do security and privacy play a role in your machine learning workflows? https://t.co/yLEskRK19C
[D] What's a good, state-of-the-art but lightweight, low-compute approach to language modelling with a small corpus? https://t.co/8rQ0CNCSxi
[R] Looking for Alternatives to STDP - Spiking Neural Networks https://t.co/NE4Ej8eWH8
[N] The Click Reader has launched a 3-month data science specialization course with Python for free! https://t.co/uEKAiT5v5k
[R] Eyes on Me: Google AI ‘MediaPipe Iris’ Improves Iris Tracking and Distance Estimation https://t.co/opB3UA7xQJ
[N] Softconf down? https://t.co/57JYqQanpz
[R] Deep Learning for Deepfakes Creation and Detection: A Survey https://t.co/Az4MF1cKWs
[D] BPDA for Adversarial Patches https://t.co/5rqMfOanV1
[P] Pre installed MacOS for AI, Machine Learning and DL https://t.co/qC7rnKhNsC
[R] ACM SIGIR 2020: Research &amp; Development in Information Retrieval https://t.co/kUENNufH6c
[Discussion] - Interesting way to compute objects. Is it already known? https://t.co/UODcmU1xo5
[D] What do you guys do to enhance your coding skills? Do you take time out on a regular basis to practice? https://t.co/CqwWYgCl3M
[D] [P] A bunch of tricks from a CV expert for doing Data Exploration for Image Segmentation and Object Detection +… https://t.co/MR7BC1r1UD
[D] How can procedural content generation help machine learning? https://t.co/hMh9GgZdYE
[N] Do you want to accelerate the production of new optical devices with your research and advance the numerical to… https://t.co/tD9scvkBGz
[D]: Multiple low risk events convert to high risk https://t.co/Rv01CGbWoT
[Project] Measuring a listener's tolerance to the quality of audio files (Update) https://t.co/LJMNADAzr9
Recombee vs. ThinkAnalytics [D] https://t.co/lqG19es28W
[D] What is the practical difference between the traditional GAN formulation and the Wasserstein GAN? https://t.co/gxyJKKfbYp
[D] Simple Questions Thread August 02, 2020 https://t.co/nqJ651SOYo
[D] Any paper on pooling operation in transformers? https://t.co/5fxxd6cEjF
[D] Ai used in generating Porn? https://t.co/Q5PjAFJeVb
[D] Research Engineer or PhD? https://t.co/9upFq08hKs
[D] Can context insensitive word embeddings (I.e. GloVe) be used successfully for word-sense disambiguation? https://t.co/HXsobHq0cd
[P] I created a game for learning RL https://t.co/qESBd24g1U
[D] What is automatic differentiation? (Video) https://t.co/asG5AsrW7j
[D] Air France Flight 447 crashed into the Atlantic and was missing for two years - Until a group of statisticians… https://t.co/C2f6X6yxF7
[D] Self-supervised representation learning on videos https://t.co/VHPGuOM9Q1
[D] AI-Powered ‘Genderify’ Platform Shut Down After Bias-Based Backlash https://t.co/sFlvDDdYYV
[D] DCGAN question about input list for image sample https://t.co/C0WptIjbcj
[P] I've asked a dozen researchers about their favourite ML books, here are the results https://t.co/LJw7rSBuOr
[N] MLPerf Training v0.7 Results Released: Google &amp; NVIDIA Lead the Race https://t.co/SRf3xnRSpe
Licencing in Machine Learning Models [R] https://t.co/ba2JI2J4Cf
[D] Multiple-GPUs vs. 'stronger' Single GPU (For Keras LSTM) https://t.co/InIGbLgD6s
[D] Loss function for maximizing "hit-rate" https://t.co/W1GsN0SLFc
[D] AWS customers who deploy models for realtime inference: do you use AWS Lambda vs. AWS SageMaker vs. open-source? https://t.co/kPCzRd84UU
[R] Towards Learning Convolutions from Scratch: Fully-connected MLP gets 85% on CIFAR-10, 60% on CIFAR-100 and 94%… https://t.co/v2UqcMUd6K
[P] Neuroevolution From Scratch https://t.co/eBZ8Dlc8dv
[N] Curated list of GPT-3 apps (25+ examples!) https://t.co/4BVfbtD9Qi
[D] Interesting reddit conversation with one of Google's Tensorflow for Swift developers on choosing Swift over Jul… https://t.co/qfmO6PeC1b
[R] Why are papers on new ReLU-replacing activation functions not published? https://t.co/O0RlTaiQPE
LiteSeg: A Litewiegth ConvNet for Semantic Segmentation (67.81% mIOU at 161 FPS on the Cityscapes dataset.) https://t.co/Pp56QjMVt4
[D] Books and Reading Recommendations for AGI https://t.co/uEdz1pxM6P
[P] Possible to implement custom backprop? https://t.co/dO8v8q6AqH
[Project] Transliteration for 6 major Indian Languages. https://t.co/K95l7I8313
Person standing at varying distance from camera dataset [P] [R] https://t.co/jMcreo3W2K
[R] DeepMind’s AlignNet Learns Stable Object Representations Across Time https://t.co/N2JUPWp4CC
[D] Latent variable models in Jax https://t.co/JH7Ehamvke
[R] EMaQ: Expected-Max Q-Learning Operator for Simple Yet Effective Offline and Online RL https://t.co/vKWQpLnVEk
[R] online real time DNN- resources https://t.co/n3s9CpZMu5
[Research] Plugging backdoor vulnerabilities in neural networks https://t.co/voq7WKLQAh
[D] Visualizing "channel-wise" class activation map (CAM &amp; grad-CAM) for stacked input (images). https://t.co/JexEnUehuf
[D] Graphical Models on Graph Valued Data? https://t.co/bWi7ejQwAF
[D] DeepFaceDrawing Generates Real Faces From Sketches. Image-to-image translation in 2020+, is it biased, could it… https://t.co/TWbTTo6MyN
[Discussion] I have created a object detection model and need to deploy it in real time. Offline or Online? https://t.co/Fwc08KxI48
[P] Play-test the most popular models in ML, directly from your browser https://t.co/lLTzktDxg9
[R] Receptive field with gradient ---to replace convolution? https://t.co/HsTYrBAjJd
[D] Consumer GPU cloud rental (https://t.co/3E9OdSro6m) https://t.co/HpyQaMbFDg
[D] https://t.co/fMcGLkymeD course notes https://t.co/Vgpdggg2rO
[R][D] discussion with the author of Temporal Graph Networks (TGN) https://t.co/yLnl8iS1jA
[P] Deep Dream video series (The AI Epiphany) https://t.co/b0ur2nA4ES
[D] Do researchers at Tesla Motor Inc. not publish any research papers in ML? https://t.co/WUzLcIL94F
[Project] The Generalized Mixture Transition Distribution models and mtd-learn package https://t.co/86cfl5gTdt
[P] Heart Attack Prediction https://t.co/XlPZVYs3Io
[P] How I (almost) replicated OpenAI's GPT-2 (124M version) https://t.co/QYiuEA29TD
[D] Combining the Adam optimiser and learning rate decay https://t.co/wuQi3XweZQ
[R] Recurrent Independent Mechanism https://t.co/f9512w6C7B
[R] Implementation of Machine Learning templates to the Open Source Nexss Programmer https://t.co/UDaKnwjbPt
[Project] We built an open source annotation tool for NER and NEL dataset with spatial data. Feel free to contribute https://t.co/0t74rIgKF8
[R] What is the status about the capsule networks? https://t.co/YX3C6ER92d
[Discussion] Ethics and working in the industry https://t.co/WuyzhKDlaN
[R] Opytimizer: A Nature-Inspired Python Optimizer https://t.co/VOTtQQbKpa
[R] Meta-learning hyperparameters over long horizons https://t.co/huZKNo14fz
[P] Experiments with 4-axis img-GPT extensions "plus signs" https://t.co/NLjWtgA55n
[D] Just got a Titan RTX. Should I return it now and wait until Sept? https://t.co/ehibpGx6fq
[R] Lenia and Expanded Universe https://t.co/xldStenyax
[D] What are your reviews on the latest NLP Course offered by Andrew Ng https://t.co/4WvODgMQY6
[R] CVPR 2020: The Top Objection Detection Papers https://t.co/nXz8cJpzEd
[D]Take full advantage of Position encodings for unlimited sequence length https://t.co/yTwBPxOpX9
[Discussion] Where can small AI based companies make a difference? https://t.co/WWSdfnrxYB
[P] Survey: External Data Sources for the Training of Machine Learning Models https://t.co/VIPQSi9chw
[R] Universal Approximation - Transposed! https://t.co/gC4MlyOpcS
[P] From 2D to 3D Using Neural Nets - 3D reconstruction from single image, GANs to create fake 3D models and digita… https://t.co/nbNDUDotSB
[R] BBO Challenge: Find The Best Black-Box Optimizer For Machine Learning https://t.co/Pp2RR8s0Ax
[P] Experiments with DQN https://t.co/cfmTZhTW8G
[D] Practically Coding Video Descriptors for Action Recognition https://t.co/XieAnbAb33
[Discussion] Fact recognition from a sentence https://t.co/Ba2IKGJY3h
