Shiver: A Python thread pool for running LLVM functions in parallel: submitted by  cypherx  [link] [comment] http://t.co/JiFLBDUQmc
Trying to prove python is the way to go, need advice: Hi /r/python, Lurker for about a year, I love how strong... http://t.co/rBpskVwYFX
PyPy 2.0 Released: submitted by  AncientPC  [link] [comment] http://t.co/6NE5HLYiuF
PyPy 2.0 - Einstein Sandwich: submitted by  franciscosouza  [link] [comment] http://t.co/89DEeSasWP
Python Closures Explained: submitted by  pratz0909  [link] [1 comment] http://t.co/jKjzsQhHOn
Building Python Packages with Maven: submitted by  m4dc4p  [link] [comment] http://t.co/sMypeXjuEG
How I Made Porn 20x More Efficient with Python: submitted by  vfxGer  [link] [1 comment] http://t.co/Kmibq8LxPM
I've found my niche and I'd like to build a Python career on it.: I'm a 27 year-old office clerk but for the p... http://t.co/YZ99V8XlAP
Debugging CherryPy applications with Werkzeug: submitted by  cyraxjoe  [link] [comment] http://t.co/XkDhbU4PKW
Running Supervisor on OS X.: submitted by  nicksergeant  [link] [comment] http://t.co/uC6iOxxSoK
I created a python auto import helper plugin for vim. Testers needed.: submitted by  moscownights  [link] [2 c... http://t.co/s3Z36mVky6
So very confused.: What is wrong with this line? It keeps telling me "ValueError: size of tuple must match num... http://t.co/Pp4aUm9181
Any relevant project made using Pattern module? Any experience with it?: Just in case you don't know, check th... http://t.co/ExABwjvhBk
MacroPy, now available on PyPI: submitted by  lihaoyi  [link] [comment] http://t.co/qsiJ8xoRjn
MySQL Connector/Python 1.0.9 available for download: submitted by  throughactions  [link] [comment] http://t.co/m1NhdvPxrU
Speech recognition for Python on Windows?: I'm having trouble finding anything that works well. I know there's... http://t.co/b4Xp86U6fj
File format fun: Salvaging partially downloaded ZIP archive: Most of archivers will error out on a corrupt (eg... http://t.co/0RNUrnV67a
Accelerating Python Libraries with Numba (Part 1): submitted by  quasiben  [link] [comment] http://t.co/iJhRCYBG4x
Programming Newbie: Well, it started a while ago, me and some friends decided to put a text-based together in ... http://t.co/JrmB97C5FD
Python and Win 7 UAC: So, (I'll post this over in /r/learnpython as well, figured it was worth a shot here as ... http://t.co/Aa9IBWBIg7
Python News Roundup – 5/7: submitted by  throughactions  [link] [comment] http://t.co/0g0bKN7Chv
Arrow: better dates and times for Python (v 0.2.0): submitted by  crsmithdev  [link] [1 comment] http://t.co/FhJtB4g1Q0
Bearcart: Interactive time series plots with Python Pandas and Rickshaw.js: submitted by  Enginoob  [link] [1 ... http://t.co/fBIQvFjoCH
PyPy Status Blog: PyPy 2.0 alpha for ARM: submitted by  rguillebert  [link] [comment] http://t.co/mgLqCmxuSs
Almost a Hundred Python Resources, Libraries and Tutorials: submitted by  EIRGFA  [link] [comment] http://t.co/02DJ9NShdI
proxypypi released : a caching proxy for reliable, fast PyPI access: submitted by  r1chardj0n3s  [link] [1 comment] http://t.co/8cWdACEhM4
Please, give me your honest criticism of my landing page. Thank you: submitted by  worthy_ideas  [link] [comment] http://t.co/fzCIEezL4V
ipython-sql for multi-database comparisons: submitted by  throughactions  [link] [comment] http://t.co/V835U90zhc
Anyone feel like fixing Digsby's Gmail integration?: Now that Digsby is open source anyone can contribute. I'd... http://t.co/J42y43q3Yn
Control Systems Library for Python: submitted by  jayrambhia  [link] [comment] http://t.co/W3zw4PNg0U
What is Python not a good language for?: I am moving from writing one-off code and scripts to developing tools... http://t.co/25uMcqQ70t
Install Python 2.7 (homebrew + pip + virtualenv) on Mac OS X Lion: submitted by  daspecster  [link] [comment] http://t.co/w1kEEGqcJQ
I create a little sqlalchemy template/snippet. Do you know more of these?: submitted by  Drvaon  [link] [comment] http://t.co/AQtwMWSkJh
Phusion Passenger 4: a new app server for Python WSGI: submitted by  FooBarWidget  [link] [comment] http://t.co/DT5y7XFLC5
Getting started with automated testing: This introductory talk about automated testing for Python was given by... http://t.co/9QW6s3Bhc4
A Night In The Life of a Computer Programmer: submitted by  worthy_ideas  [link] [comment] http://t.co/842PQXCmd8
python -m : (pydoc, pyclbr, pdb, pstats, timeit, ...): submitted by  westurner  [link] [1 comment] http://t.co/9bpXeGe9gc
Manage.py, a human friendly CLI builder for python apps: submitted by  B3QL  [link] [comment] http://t.co/wzh2YNhxdo
pypi:rfc3987: regex parsing and validation of URIs (RFC 3986) and IRIs (RFC 3987): submitted by  westurner  [l... http://t.co/lAmY3rbpT1
Ruby, Python, Javascript...or something else??: I'm trying to decide which language I should focus on learning... http://t.co/jttu6bYKot
Python REPL finally gets tab completion by default: submitted by  tpk1024  [link] [1 comment] http://t.co/C7wQkvGtN0
Python help for a newbie: My loop is wrong, and i can't get the tax to work correctly.. help! A=5.45 B=4.49 C=... http://t.co/NrVEJPrzl2
Scipy Conference 2013 early bird registration ends in two days: submitted by  Oncocerca  [link] [comment] http://t.co/tuCDS48Dk7
Report: Comparative Benchmark of Nginx, Lighttpd, &amp; Node.js (via C++11 &amp; Python): submitted by  timemanifold  ... http://t.co/QcVuAG8Uon
New Committers for Tastypie &amp; Haystack: submitted by  rchaudhary  [link] [comment] http://t.co/H47Utt0vsT
Looking for recommendation for alternate libreadline bindings: I'm looking for an alternative to the readline ... http://t.co/9Hp7hEFH7J
OpenStack: Open source software for building private and public clouds: submitted by  westurner  [link] [comment] http://t.co/ak3s7By8Gr
David Beazley's Python Cookbook 50% off today: I recently grabbed the pre-release of David Beazley's Python Co... http://t.co/wS1DjnAOYV
How To Be a Software Developer Without a Degree - Mirror Post: submitted by  worthy_ideas  [link] [comment] http://t.co/qjWpCwUAfa
kdev-python 1.5 released.: submitted by  mssola  [link] [comment] http://t.co/8oxHPekTap
redisbayes - Naïve Bayesian Text Classifier on Redis in Python (Good for spam filtering): submitted by  jart  ... http://t.co/7Cq4c2Yxp4
Coded Structure: The Dynamics of Catching Exceptions in Python: submitted by  throughactions  [link] [comment] http://t.co/mQH8jlBYEj
Cartesian Tree-Product: an interesting, real-life algorithmic problem: submitted by  gangesmaster  [link] [comment] http://t.co/W78vSqbAhB
Another Thing About Python's Threadlocals: submitted by  gthank  [link] [comment] http://t.co/pFvU61CtD6
Content-addressable backup to Amazon Glacier and S3, in ~200 lines of Python: submitted by  iwd32900  [link] [... http://t.co/8spAHg4qYz
How To Be a Software Developer Without a College Degree: submitted by  worthy_ideas  [link] [comment] http://t.co/p0eI1AaJDG
Converting presentation slides to HTML blog post with images: submitted by  throughactions  [link] [comment] http://t.co/IDug8seAWH
Get an interactive browser-based console for any Python Gist: submitted by  hjwp  [link] [comment] http://t.co/3mX4Q3S31E
Advanced Machine Learning with scikit-learn: submitted by  trojan89  [link] [comment] http://t.co/160Pk4Q3Ro
pySFML 1.3.0 - Python bindings for SFML 2.0 released: submitted by  1nvader  [link] [comment] http://t.co/CNRr702x1W
Today (Thursday) Python Meetup near Copenhagen, DTU Campus; you are welcome: submitted by  halst  [link] [comment] http://t.co/oPhL1LL5kj
Why there is so many python packages in pypi for printing nested lists?: No idea why this problem has so many ... http://t.co/F6D5svwjWW
Light Table: What are your thoughts?: I haven't had a chance to sit down and play with it, but it looks promis... http://t.co/ri8grgNe7R
Customize your IPython notebook with CSS: submitted by  throughactions  [link] [1 comment] http://t.co/smGxvtq4Ux
Chemlab 0.2 released. With database integration and ipython support!: submitted by  gabrielelanaro  [link] [comment] http://t.co/bgMeshXmsR
PDF in a Bottle - creating PDF using xtopdf, ReportLab, Bottle and Python: submitted by  throughactions  [link... http://t.co/UyxJaaSZzy
Python News Roundup – 5/1: submitted by  throughactions  [link] [comment] http://t.co/gORB83okpi
What are your favorite Python resources (blogs, SO users, etc.)?: Other than /r/python of course. I really lik... http://t.co/X6DmqXuwo5
AngularJS to PyGame: Caktus’ 2nd ShipIt Day: submitted by  throughactions  [link] [comment] http://t.co/d70vPAOTvS
Deploying Flask to Heroku and Creating an Android App with PhoneGap: submitted by  strangeloops  [link] [comment] http://t.co/hyXX2SdAJr
Light Table 0.4 released with Python support.: submitted by  DrWyckoff  [link] [comment] http://t.co/ho0JXuEeyz
Making a map with Python, BeautifulSoup, and Google APIs: submitted by  WillieWampum  [link] [comment] http://t.co/yvKEc4rtvU
Python DateTime / Timestamp Convertion [GIST]: submitted by  jul1an  [link] [comment] http://t.co/SPJ3PTY9Ul
Creating Map Visualizations in  Enginoob  [link] [comment] http://t.co/4ubIyn2qRK
Hooray! The PyDev/Liclipse funding goal has been reached.: submitted by  cito  [link] [comment] http://t.co/5EodjoMxRd
Unable to install boto in a virtualenv: submitted by  khanio  [link] [comment] http://t.co/vRRfJtHRlb
I got bored of homework. Whipped up a Bandcamp ripping script for you all.: submitted by  viiralvx  [link] [comment] http://t.co/vIVtOBoUsH
Learn a Programming Language In 21 Days &amp;#8211; Not: submitted by  worthy_ideas  [link] [comment] http://t.co/h7x0zvd8Xp
__dunder__ functions [video]: submitted by  myusuf3  [link] [comment] http://t.co/kQQKbq9NlE
Unable to register and pypi: When I attempt to register an account at pypi, I am told "502 Bad Gateway" --- I ... http://t.co/aqZzwxieGT
is python a viable option for my project?: I have a script I wrote that is in javascript and is delivered via ... http://t.co/hnGEUOqrzQ
Handling MongoDB AutoReconnect-exceptions in Python using a proxy: submitted by  arngarden  [link] [comment] http://t.co/oDWUY7z7AU
Create a temporary mailbox « Python recipes: submitted by  throughactions  [link] [comment] http://t.co/2BhcJgx0QK
DjangoSCUBA: submitted by  jacobian  [link] [1 comment] http://t.co/a9a79UbnY8
How to use sh in Python: submitted by  spilcm  [link] [comment] http://t.co/cX4GkMWoK8
Python Front-end to GCC [x-post from /r/gcc]: submitted by  the-fritz  [link] [1 comment] http://t.co/bSnQcC2RPZ
Deeply embedded DSLs: a JSON parser using macro-powered parser combinators: submitted by  lihaoyi  [link] [comment] http://t.co/Zdu8FStHhK
Python Interview Question and Answers: submitted by  ilian  [link] [comment] http://t.co/mSNRcEsJQK
Importing os on a server running a python script: Hello,  I'm trying to get a shell running on a python script... http://t.co/abFIaCCcYF
May /r/learnpython Study Group: We're hosting a month-long online study group in May over in /r/learnpython ai... http://t.co/gt9YdXQVJ9
real python (playlist): submitted by  michaelherman  [link] [comment] http://t.co/AcETTntUWf
Fowarding Android Text Messages: Hi I am trying to make something like the pebble watch with the raspberry pie... http://t.co/uTl4Hqhj2h
Why Tuples?: submitted by  nohtyp  [link] [comment] http://t.co/NyUYocT2z1
A Vagrant Environment for Django projects: submitted by  Codehenge  [link] [comment] http://t.co/l7kQCJuexX
Python and C++ in Eve Online: submitted by  sigma914  [link] [1 comment] http://t.co/gPuBTkLctm
What: A helper for testing output of a process in tests.: submitted by  cenka  [link] [comment] http://t.co/eTs3Z4hZ0G
Lessons learned defying Joel Spolsky with Django: submitted by  AncientPC  [link] [comment] http://t.co/cXzajt0zjy
Worry-Free Parsers with Parsley (PyCon US 2013): submitted by  bboyjkang  [link] [1 comment] http://t.co/WJTGYOk40B
NLTK: A dead simple document classifier: submitted by  pupupeepee  [link] [comment] http://t.co/rMuuX74Za3
dyject: a Python Dependency Injection module: submitted by  djsumdog  [link] [comment] http://t.co/ivls9Gz0sP
Algebraic Datatypes and Pattern Matching in Python: submitted by  DeadFinks  [link] [comment] http://t.co/fTbTE5qNqN
A Rant on Python: It's slow as hell for anything too complex or system vital: GUIs, Operating Systems, even ve... http://t.co/9t54PBaBX6
Python module for creating Excel files with Charts: submitted by  jmcnamara13  [link] [3 comments] http://t.co/t2lUapl70T
Preview of the Python bindings for the PolyVox voxel management library: submitted by  milliams  [link] [comment] http://t.co/SrN3WybvP5
wxPython – Having Fun with Silly Ciphers: submitted by  throughactions  [link] [comment] http://t.co/uZ6MgirBZd
Web crawler with python twisted: submitted by  init0  [link] [comment] http://t.co/t4vb5u77Kj
What Makes Code Hard to Understand? (xpost from /r/programming): submitted by  jabbalaci  [link] [1 comment] http://t.co/H52smA4Ae9
I hate to try to start something, but I've never seen this kind of ignorance before. Do people really see Pyth... http://t.co/DWB5dkVDFu
Using Celery for queuing requests: submitted by  throughactions  [link] [comment] http://t.co/FOPUc7vhd4
A python library of all bi-conditional logic gates, let me know if any are missing. p.s., I wrote them all to ... http://t.co/XoIikrLvQx
rootpy : a more pythonic interface with CERN ROOT on top of the existing PyROOT bindings.: submitted by  mrtom... http://t.co/7jsDo8Ufic
NumPy Beginner&amp;#8217;s Guide Giveaway Contest: submitted by  exnzvs  [link] [1 comment] http://t.co/hX2RNG8t2H
OpenSSL hangs CPU with Python  benhoyt  [link] [comment] http://t.co/IsX4WhaT8X
Python Twitter Tools with iPython Notebook: submitted by  monkmartinez  [link] [comment] http://t.co/MpQZJKqESj
Library to process/sqlquery a list of dicts/custom data?: Basically i query a database of events where an even... http://t.co/y3jjTdrfwd
non-blocking Celery client for Tornado web framework: submitted by  user8677  [link] [comment] http://t.co/SuZ5pZ14GE
What exactly happens when I run a Python script?: I have a pretty vague notion of my script getting converted ... http://t.co/x7aTXnqfsg
Book on 'OpenCV Computer Vision with Python': submitted by  jayrambhia  [link] [comment] http://t.co/UVIBOQwxeT
Pythonect (a new, experimental, general-purpose dataflow programming language based on Python) Interpreter v0.... http://t.co/uqSJkvjiMs
Using python to take csv data and format it into Word document: Hi everyone. Kind of a newb to Python and I've... http://t.co/Jr0rj9snJd
Simple integration of Razer Hydra to a mouse and keyboard. I don't have time to develop it any further so I fi... http://t.co/8dqnsD1aQB
My talk at Pycon about Financial Data: submitted by  investary0  [link] [comment] http://t.co/ZfkFjmeaFA
Game Creation with Python: Does anybody know a good group of tutorials about how to use python to create a sim... http://t.co/fozKN5asrc
Unicorn - Simplified, lightweight HTTP Rest Libraries for Python, Java, Objective-C, Ruby, and PHP: submitted ... http://t.co/tfYPvBhdTj
Discover which tests are affected after modifying files - nose-knows 0.1.1: submitted by  namcor  [link] [comment] http://t.co/y2fiujwM7D
how to print output like "less" in shell?: Say I'm in the python3 REPL, and I have something which gives 500 l... http://t.co/8ynrBwvSSn
with open(BugFix) as FinallyHurray: Dance: submitted by  Vonney  [link] [comment] http://t.co/qwer8czIJP
SciPy2013, 12 awesome tutorials from beginner to advanced: submitted by  aterrel  [link] [comment] http://t.co/Jv7t7iK2tA
Help, i am a noob to python and was looking up tutorials, yet keep coming across this error when i try and run... http://t.co/65iUqvTlUw
Could someone with a AirPort Extreme or some other nat-pmp enabled equipment test my code?: Hey Reddit I've be... http://t.co/1cuNr03tr9
BibTeX-powered publications list for Pelican with pelican-bibtex: submitted by  vnfrombucharest  [link] [comment] http://t.co/2PF5Ood1MU
What concepts would a Python dev benefit from in learning Java?: Obviously this is a question for folks season... http://t.co/h8uTCHq09p
Small parts of Python builtins functionality you might overlook: submitted by  __DAT_USERNAME__  [link] [comment] http://t.co/IbgP5PMkvZ
Open Source projects, where to find them?: So I'm fairly new to Python (About 5 months in) and I did some Code... http://t.co/qi7EwnBYYu
Multithreaded Python Tutorial with the “Threadworms” Demo: submitted by  AlSweigart  [link] [comment] http://t.co/7atARSRSCV
Scientific Computing Question. Matlab vs. Python (XPOST from /r/learnpython): Hi, I'm trying to learn how to u... http://t.co/rqrcIuKRAq
Why do people still use Python version older than 2.7?: I was reading PEP 3146 titled "Merging Unladen Swallow... http://t.co/GoFVgJjuvc
Falcon - High-performance cloud API framework: submitted by  redditthinks  [link] [comment] http://t.co/Zv7upJtcgZ
Bootstrapping virtualenv: submitted by  srwalker101  [link] [1 comment] http://t.co/ETPuIU9EP1
A fun hack, and the always-relevant goal of improvement: Even after two years of starting, I feel like a pytho... http://t.co/JDXMVGunp7
[Ask] What python libraries are available to manage relational databases?: I feel somewhat awkward asking this... http://t.co/EF6wEIEmUV
PQL 0.2 is out! converts python expressions to MongoDB queries: submitted by  alonho  [link] [comment] http://t.co/QLZ5YJzEKK
Plotting Time Series with Pandas DatetimeIndex and Vincent: submitted by  Enginoob  [link] [comment] http://t.co/T5mjEDD8pV
A SoundCloud download script I've recently updated.: submitted by  0713_  [link] [comment] http://t.co/1EOg5zI2DN
Serpent, a serialization library based on ast.literal_eval. Also has Java and .Net implementations: submitted ... http://t.co/Pk809WfY3Z
[META] What has this subreddit turned into?: A lot of basics question asked, very simple and bad scripts prese... http://t.co/4ercb2sSn4
Frog Media Server django app: I have been working on a media site for artists in a creative environment like g... http://t.co/2W7jTkv5RX
Hey there! I made a program that executes Python code at a PasteBin URL. I've stopped working on it, but it mi... http://t.co/F07zuIiByo
PyExcelerate: Accelerated Excel XLSX Writing Library for Python 2/3: submitted by  whitehat2k9  [link] [comment] http://t.co/KU87uw8jgc
Mergou, a shell-like python code browser toy. Suggestions needed as what to implement next.: submitted by  ych... http://t.co/j4zc16mTGA
Pyreshark (Wireshark plugins in Python) v0.0.5 released.: submitted by  B3QL  [link] [comment] http://t.co/mW4hNOYeKG
An introduction to compressed sensing (with Python): submitted by  roger_  [link] [comment] http://t.co/G355Txyqzi
Python: Number Conversion Chart: submitted by  cool-RR  [link] [1 comment] http://t.co/usTuNMoHre
BlooCoin - Crypto-currency that uses a central server instead of a peer-to-peer network. Written entirely in P... http://t.co/rTBDv4HrPK
I created a syntax checker to help write Python 3 compatible code. Works with vim/syntastic!: submitted by  li... http://t.co/mgDmXDtyyx
A library to control Arduino boards using Python code.: submitted by  thearn4  [link] [comment] http://t.co/qrjoC3D5mX
DAGPype: A Python framework for scientific data-processing and data-preparation DAG (directed acyclic graph) p... http://t.co/3dX5Fwtvsy
Hi r/python! I've released a tool to execute commands in parallel across a multitude of hosts via ssh and grou... http://t.co/xYpGfKbv3y
Python plugin user guide for Kate text editor: submitted by  JRepin  [link] [comment] http://t.co/sFQfKUpGDJ
Can anyone point me to some information on how "as" is used in Python?: Example code: def bad(): e = None try:... http://t.co/mV1qg4LCfz
Cyber World: Palindrome recognizer: submitted by  gaurang0017  [link] [comment] http://t.co/lO7NxzQEW4
python to matlab file: I have a program that solves an optimization problem using an iterative solution. The r... http://t.co/qKOCMWGs6Z
Confused with remainders!?: I am doing some examples and I am lost on remainders. When I do 2%3 why does that ... http://t.co/9Y8aH3z5p8
FREE FOR REDDIT || Coding for Entrepreneurs with Django &amp; Python. Learn by doing. First Project | an eCommerce... http://t.co/zmBwHCy3F4
Help! I'm trying to do a Twitter request using Python and some modules/repositories. I'm new at this and havin... http://t.co/nGxBm0bNoD
Reverse image search [Boston]: I hope this is a fair question to ask. Not sure it'd work or if it's even plaus... http://t.co/dNHdkk2b5U
Python's Magical Self p.2: Rebuild Everything: submitted by  concentricsky  [link] [comment] http://t.co/ya9wuHMalf
PyCharm 2.7.2 released: submitted by  tpk1024  [link] [comment] http://t.co/WIBp8KImw3
Using Requests in an APIWrapper pattern: is this normal?: submitted by  DrZealot  [link] [comment] http://t.co/b2NNRYxnrq
Mass mailing app written in Python: Hi r/python, I wrote a small mass mailing application with a big address b... http://t.co/hxVla5rlwF
Lightweight celery? Have tasks run within your application at specific times / days...: Hello, I was recently ... http://t.co/aqJSwoZM48
Real world Pandas: Indexing and Plotting with the MultiIndex: submitted by  Enginoob  [link] [comment] http://t.co/cHUU5S5wRW
Learn to create, customise and modify ArcGIS 10.1 with Python with Packt's new book and ebook: submitted by  d... http://t.co/zbWDjP6GiA
Has anyone tried Kivy? How is it?: I'm looking to develop a fairly simple application for mobile devices. I do... http://t.co/98V5E4D8Fq
Our professor gave us the homework to print every second character of our name with a bash script. I came up w... http://t.co/SCvy7tjjKT
Anyone tried pyjamas here? appreciate to here your thoughts....: submitted by  stoned-coder  [link] [1 comment] http://t.co/erHFCafA6N
11 Things I Wish I Knew About Django Development Before I Started My Company: submitted by  wasthedavecollins ... http://t.co/oSCpDBf8Bc
Very stupid question, but I don't know how to phrase it for google. If you have a function red, what are the d... http://t.co/nGkJ3wMdZm
Pyramid View Configuration, Let Me Count the Ways: submitted by  mcdonc  [link] [comment] http://t.co/QPziPfpe3O
Please show PyDev some love. Only 26 days left.: submitted by  cito  [link] [comment] http://t.co/entlSDjqX6
Logging time, part 2: gtimelog on the commandline: submitted by  throughactions  [link] [comment] http://t.co/WLThCgSMAW
Email Actions with Python: Howdy r/python! My question is in regards to a project I'm working on and wondering... http://t.co/gABTQoI0mr
Why I don't use PyPy much: submitted by  __DAT_USERNAME__  [link] [comment] http://t.co/3MyrJYsC70
I'm working toward a standard tree implemention, and would very much like to get your input!: Hey there! I'm d... http://t.co/7Zuhqb9UO5
A little help for a first time Python user?: submitted by  IndolentSloth  [link] [6 comments] http://t.co/z4VaLCr9Rk
Can I edit Little Snitch access control lists via CLI, somehow? Otherwise every virtualenv’s python binary can... http://t.co/YNnXylxqYZ
Sage Accepted for Google Summer of Code 2013 - Check it out! (x-post r/sagemath ): submitted by  Campers  [lin... http://t.co/KJDKevLH60
Google Glass supports Python: submitted by  nagasgura  [link] [comment] http://t.co/YEwpN8aKml
Python 2 -&gt; Python 3 migration might not be possible in applications using pickle serialization: submitted by ... http://t.co/NZLYy24BnI
Code Golf: solve any Sudoku in 176 characters: submitted by  jakevdp  [link] [comment] http://t.co/TjpXnDj48M
Storing and Retrieving Data From Google App Engine Datastore: submitted by  monster_drink  [link] [comment] http://t.co/vqpwBQSVyS
Please recommend some techniques for managing database schema migrations and other data tasks during developme... http://t.co/YMt8N3oIRt
Vincent: A Python to Vega.js translator: submitted by  Enginoob  [link] [comment] http://t.co/Mpmbu0S44c
Camelot 13.04.13 released : Elixir replaced with Declarative, SQLAlchemy 0.8.0 support, improved import/export... http://t.co/aPpo4S95G1
Python on Android?: Hello, I am web developer trying to make a simple android game. I know that java could be ... http://t.co/wZCulrbcvB
Screenshoot - the Python screenshotter: submitted by  Shazer2  [link] [comment] http://t.co/QEzb7vOBLp
Can anyone tell me if there are any disadvantages to using IntelliJ IDEA Ultimate and not PyCharm?: Given that... http://t.co/NAUm4wqIcA
Python or Ruby Non-Biased Please!: Okay so I've been at Ruby for about a month and half now,(this is my first ... http://t.co/YrvoRFVXJM
PyOhio (Annual Midwest Python Conference) 2013 Call For Proposals: submitted by  bcostlow  [link] [comment] http://t.co/VT2H1OpE1C
Py4J: keep a warm Java JVM ready for Python: submitted by  mordel  [link] [comment] http://t.co/Mnn4Z1kGsz
